projects/bowling/BOWLING.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>BOWLING</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-12 22:42:09 CDT"/>
<meta name="author" content="Brian T. Wightman"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">BOWLING</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Project Name </a></li>
<li><a href="#sec-2">2 Purpose </a></li>
<li><a href="#sec-3">3 Language Choice </a></li>
<li><a href="#sec-4">4 Project Description </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Project Name </h2>
<div class="outline-text-2" id="text-1">


<p>
  Bowling Game Scorer
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Purpose </h2>
<div class="outline-text-2" id="text-2">


<p>
  The purpose of this project was originally to learn how to write
  unit tests and write code in a TDD manner.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Language Choice </h2>
<div class="outline-text-2" id="text-3">


<p>
  Since the majority of my coding work was in Perl, I chose Perl as
  the language in which I would implement this project.
</p>
<p>
  As time goes on, I will be using this project to learn other
  languages as well.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Project Description </h2>
<div class="outline-text-2" id="text-4">


<p>
  Create a bowling game scoring application for standard 10-pin
  bowling rules.
</p>
<ul>
<li>A game consists of 9 standard frames and one special frame.
<ul>
<li>A standard frame allows up to two rolls to knock down a total of
      10 pins.
</li>
<li>A special frame allows up to two rolls to knock down a total of
      10 pins, with the possibility of awarding one or two bonus rolls.
<ul>
<li>A single bonus roll is awarded if all 10 pins are knocked down
        in the first two rolls.
</li>
<li>Two bonus rolls are awarded if all 10 pins are knocked down in
        the first roll.
</li>
<li>After each set of 10 pins is knocked down, a new set of 10
        pins is placed.
</li>
<li>The special frame is the last frame of the game.
</li>
</ul>

</li>
<li>After each frame is completed, any remaining pins are removed
      and a new set of 10 pins is placed.
</li>
</ul>

</li>
<li>Scoring
<ul>
<li>A scorecard looks similar to:



<pre class="src src-text"> 
  | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10  |
  +---+---+---+---+---+---+---+---+---+-----+
  |A|B|A|B|A|B|A|B|A|B|A|B|A|B|A|B|A|B|D|E|F| 
  | +-| +-| +-| +-| +-| +-| +-| +-| +-|-+-+-|
  | C | C | C | C | C | C | C | C | C | C   |
  +---+---+---+---+---+---+---+---+---+-----+

</pre>


</li>
<li>If all pins are knocked down on the first roll of a standard
      frame, or after a new set of pins are placed in a special frame,
      it is recorded as a <code>strike</code>.
<ul>
<li>An <code>X</code> is used to designate a strike on the scorecard.
</li>
<li>A strike is recorded for a standard frame in the location
        marked as <code>B</code> in the scorecard corresponding to the correct
        frame, or in the locations designated by <code>D</code>, <code>E</code>, or <code>F</code> in
        the special frame.
</li>
<li>the location marked as <code>A</code> would remain empty.
</li>
</ul>

</li>
<li>If all remaining pins are knocked down on the second roll of a
      standard frame, or after a new set of pins are placed in a
      special frame, it is recorded as a <code>spare</code>.
<ul>
<li>A <code>/</code> is used to designate a spare on the scorecard.
</li>
<li>A spare is recorded in the location marked as <code>B</code> in the
        scorecard in a standard frame, or in the leftmost empty cell
        of <code>E</code> or <code>F</code> in the special frame.
</li>
<li>The location marked as <code>A</code>, <code>D</code>, or <code>E</code> would contain the
        number of pins knocked down by the first roll of the spare.
</li>
</ul>

</li>
<li>In all other cases, the number of pins knocked down in a single
      roll is recorded.
<ul>
<li>The score is recorded in cells <code>A</code>, <code>B</code>, <code>D</code>, <code>E</code>, or <code>F</code>,
        depending on which roll of the frame the roll corresponds to.
</li>
</ul>

</li>
<li>If a standard frame ends on a strike or a spare, it is called a
      <code>closed frame</code>, otherwise it is called an <code>open frame</code>.
</li>
<li>The location marked as <code>C</code> contains the total score for the game
      as of the frame the score is recorded in.
<ul>
<li>A frame adds its score to the previous frame score.
</li>
<li>A strike in a standard frame is scored by adding the next two
        rolls to to 10 pins counted for the strike.  For example, a
        strike followed by rolls of <code>4</code> and <code>5</code> would give a frame
        score of <code>19</code> (<code>10 + 4 + 5</code>).
</li>
<li>A spare in a standard frame is scored by adding the next roll
        to the 10 pins counted for the spare.  For example, a spare
        followed by a roll of <code>4</code> would give a frame score of <code>14</code>
        (<code>10 + 4</code>).
</li>
<li>A strike or spare in the final special frame just gives the
        bonus rolls to be added into the frame score.
</li>
<li>An <code>open frame</code> is scored by adding the number of pins knocked
        down with both rolls.
</li>
</ul>

</li>
<li>Examples:
<ul>
<li>The partial game <code>1,2,3,4,5,5,9,1,10,10,3</code> is scored as:



<pre class="src src-text"> 
    | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10  |
    +---+---+---+---+---+---+---+---+---+-----+
    |1|2|3|4|5|/|9|/| |X| |X|3| | | | | | | | | 
    | +-| +-| +-| +-| +-| +-| +-| +-| +-|-+-+-|
    |  3| 10| 29| 49| 72|   |   |   |   |     |
    +---+---+---+---+---+---+---+---+---+-----+

</pre>



<p>
        You cannot complete the frame score for frame 6 because two
        rolls have not been completed after the strike.
</p>
</li>
<li>The rolls <code>1,2,3,4,5,5,9,1,10,3,4,2,3,5,4,6,4,10,2,8</code> are
        scored as:



<pre class="src src-text"> 
    | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10  |
    +---+---+---+---+---+---+---+---+---+-----+
    |1|2|3|4|5|/|9|/| |X|3|4|2|3|5|4|6|/|X|2|/| 
    | +-| +-| +-| +-| +-| +-| +-| +-| +-|-+-+-|
    |  3| 10| 29| 49| 66| 73| 78| 87|107|  127|
    +---+---+---+---+---+---+---+---+---+-----+

</pre>



</li>
</ul>

</li>
</ul>

</li>
<li>Program Execution
<ul>
<li>Prompt the user for a valid roll.
<ul>
<li>The prompt must include the frame and roll number.
</li>
<li>If the roll is invalid, generate an error message and prompt the
        user for a new roll.
</li>
<li><code>x</code>, <code>X</code>, and from <code>0</code> to the total number of pins in a frame
        are all valid input values for the first roll after pins have
        been set.
</li>
<li><code>/</code> and from <code>0</code> to the number of pins left in the frame are
        valid values for the second roll after pins have been set.
</li>
</ul>

</li>
<li>At the end of each frame, print a current scorecard.
</li>
<li>At the end of the game, prompt the user if they want to score
      another game.
</li>
</ul>

</li>
</ul>


</div>
</div>
<div id="postamble">
<p class="date">Date: 2012-05-12 22:42:09 CDT</p>
<p class="author">Author: Brian T. Wightman</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
